#Шифр Цезаря
a1 = "abcdefghijklmnopqrstuvwxyzabcdefghijklmnopqrstuvwxyz"
#Екінші алфавит алфавиттің соңғы әріптерін шифрлайтын жағдайда қажет, яғни z әрпі шифрлау кілті 3 - ке тең болған кезде С әрпіне өтуі мүмкін
b1 = input("Enter e clear message: ")
key = int(input("Please enter a key (number from 1-25): "))
b1 = b1.lower() #lower() - жоғарғы регистрді төменгі регистрге айналдырады. Мысалы, А - а, В - b
b2 = ""
#Біз әр әріпке оның нөмірі бойынша сілтеме жасап, содан кейін жаңа нөмірді есептеу үшін циклды қолданамыз
for s1 in b1:
  position = a1.find(s1) #Find () функциясы бірінші сәйкестікті іздеу үшін айнымалы алфавитке жүгінеді және сол әріптің реттік нөмірін қайтарады
  newPosition = position + key #Әріп индексіне кілт қосу
  if s1 in a1: #Таңбаны тексеру
    b2 = b2 +a1[newPosition] #Бұл жолда жаңа позиция бар. Ауыстырғаннан кейін ол шифрланған хабарламаға қосылады
  else:
    b2 = b2 + s1 #Егер таңба болмаса (мысалы, үтір немесе сызықша), онда ол шифрланған хабарламаға сол күйінде қосылады
print("Your cipher is: ", b2)